In [53]:
import pandas as pd
import numpy as np

employees = pd.read_csv('employees.csv' , sep= ':')
print(employees.columns , '\n')
print(employees)

Index(['id', 'name', 'age', 'specialization'], dtype='object')

    id         name   age             specialization
0    2        shine   NaN              data engineer
1    3     kunjacks  22.0                        NaN
2    4        sisly  32.0          flutter developer
3    1        jonny  77.0          flutter developer
4    5       daveed   NaN               data science
5    6        lilly  18.0                        NaN
6    9  thomaskutty   NaN          flutter developer
7    8         mary  37.0                        NaN
8    7        eesha  21.0               data science
9   11        neena  38.0          flutter developer
10  18  georgekutty   NaN               data science
11  20     shoshama  27.0          flutter developer
12  21       nithin  20.0  python mobile development

identifying missing values

In [54]:
print(employees.isna()) #or 
print(employees.isnull())

       id   name    age  specialization
0   False  False   True           False
1   False  False  False            True
2   False  False  False           False
3   False  False  False           False
4   False  False   True           False
5   False  False  False            True
6   False  False   True           False
7   False  False  False            True
8   False  False  False           False
9   False  False  False           False
10  False  False   True           False
11  False  False  False           False
12  False  False  False           False
       id   name    age  specialization
0   False  False   True           False
1   False  False  False            True
2   False  False  False           False
3   False  False  False           False
4   False  False   True           False
5   False  False  False            True
6   False  False   True           False
7   False  False  False            True
8   False  False  False           False
9   False  False  False           False
10  False  False   True           False
11  False  False  False           False
12  False  False  False           False

find non missing values

In [55]:
print(employees.notnull()) #or
print(employees.notna())

      id  name    age  specialization
0   True  True  False            True
1   True  True   True           False
2   True  True   True            True
3   True  True   True            True
4   True  True  False            True
5   True  True   True           False
6   True  True  False            True
7   True  True   True           False
8   True  True   True            True
9   True  True   True            True
10  True  True  False            True
11  True  True   True            True
12  True  True   True            True
      id  name    age  specialization
0   True  True  False            True
1   True  True   True           False
2   True  True   True            True
3   True  True   True            True
4   True  True  False            True
5   True  True   True           False
6   True  True  False            True
7   True  True   True           False
8   True  True   True            True
9   True  True   True            True
10  True  True  False            True
11  True  True   True            True
12  True  True   True            True

In [56]:
#count of missing values per column

print(employees.isna().sum())
#if u use count() u get the number of rows not the nuumb of missing values

#drop missing values , displays only rows without any missing values
print(employees.dropna())
#fill for filling and replace for replacing specific value and not filling but can also be used for filling

id                0
name              0
age               4
specialization    3
dtype: int64
    id      name   age             specialization
2    4     sisly  32.0          flutter developer
3    1     jonny  77.0          flutter developer
8    7     eesha  21.0               data science
9   11     neena  38.0          flutter developer
11  20  shoshama  27.0          flutter developer
12  21    nithin  20.0  python mobile development

In [57]:
print(employees.dtypes)
#only columns with selected data type will be printed
print(employees.select_dtypes(include=['number' , 'object'])) #including
print(employees.select_dtypes(exclude='object')) #excluding

id                  int64
name               object
age               float64
specialization     object
dtype: object
    id         name   age             specialization
0    2        shine   NaN              data engineer
1    3     kunjacks  22.0                        NaN
2    4        sisly  32.0          flutter developer
3    1        jonny  77.0          flutter developer
4    5       daveed   NaN               data science
5    6        lilly  18.0                        NaN
6    9  thomaskutty   NaN          flutter developer
7    8         mary  37.0                        NaN
8    7        eesha  21.0               data science
9   11        neena  38.0          flutter developer
10  18  georgekutty   NaN               data science
11  20     shoshama  27.0          flutter developer
12  21       nithin  20.0  python mobile development
    id   age
0    2   NaN
1    3  22.0
2    4  32.0
3    1  77.0
4    5   NaN
5    6  18.0
6    9   NaN
7    8  37.0
8    7  21.0
9   11  38.0
10  18   NaN
11  20  27.0
12  21  20.0

In [58]:
employees_dupe = employees
employees_dupe['specialization'] = pd.to_numeric(employees_dupe['specialization'],errors = 'coerce')
#error = coerce to avoid conversion errors
print(employees_dupe.dtypes)
#learn categorical datatype and its conversion

id                  int64
name               object
age               float64
specialization    float64
dtype: object

Clean your data by handling duplicates that can skew your analysis.

In [59]:
# drop_duplicates u already know

# .duplicated() return a boolean series marking duplicates
print(employees.duplicated())
#here no duplicates

#returning the duplicates only , as dataframe itself
print(employees[employees.duplicated()])
#returns nothing as no duplicate

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
dtype: bool
Empty DataFrame
Columns: [id, name, age, specialization]
Index: []

String Manipulation and Data Cleaning

In [60]:
print(employees,'\n')
print(employees.replace({pd.NA : ' DATA UNAVAILABLE' , np.nan : ' DATA UNAVAILABLE' , None : ' DATA UNAVAILABLE'}),'\n')

    id         name   age  specialization
0    2        shine   NaN             NaN
1    3     kunjacks  22.0             NaN
2    4        sisly  32.0             NaN
3    1        jonny  77.0             NaN
4    5       daveed   NaN             NaN
5    6        lilly  18.0             NaN
6    9  thomaskutty   NaN             NaN
7    8         mary  37.0             NaN
8    7        eesha  21.0             NaN
9   11        neena  38.0             NaN
10  18  georgekutty   NaN             NaN
11  20     shoshama  27.0             NaN
12  21       nithin  20.0             NaN

    id         name                age     specialization
0    2        shine   DATA UNAVAILABLE   DATA UNAVAILABLE
1    3     kunjacks               22.0   DATA UNAVAILABLE
2    4        sisly               32.0   DATA UNAVAILABLE
3    1        jonny               77.0   DATA UNAVAILABLE
4    5       daveed   DATA UNAVAILABLE   DATA UNAVAILABLE
5    6        lilly               18.0   DATA UNAVAILABLE
6    9  thomaskutty   DATA UNAVAILABLE   DATA UNAVAILABLE
7    8         mary               37.0   DATA UNAVAILABLE
8    7        eesha               21.0   DATA UNAVAILABLE
9   11        neena               38.0   DATA UNAVAILABLE
10  18  georgekutty   DATA UNAVAILABLE   DATA UNAVAILABLE
11  20     shoshama               27.0   DATA UNAVAILABLE
12  21       nithin               20.0   DATA UNAVAILABLE

In [61]:
employees['name'].str.title()

0           Shine
1        Kunjacks
2           Sisly
3           Jonny
4          Daveed
5           Lilly
6     Thomaskutty
7            Mary
8           Eesha
9           Neena
10    Georgekutty
11       Shoshama
12         Nithin
Name: name, dtype: object

CATEGORICAL DATA : categorical data should be handled properly if preparing data for machine learning

In [67]:
employees['age']=employees['age'].astype('category')
employees.select_dtypes('category')

     age
0    NaN
1   22.0
2   32.0
3   77.0
4    NaN
5   18.0
6    NaN
7   37.0
8   21.0
9   38.0
10   NaN
11  27.0
12  20.0

     age
0    NaN
1   22.0
2   32.0
3   77.0
4    NaN
5   18.0
6    NaN
7   37.0
8   21.0
9   38.0
10   NaN
11  27.0
12  20.0